html/v2ray/route/bt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>禁用BT</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="site_data.html"> UP </a>
 |
 <a accesskey="H" href="route.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">禁用BT</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org01ce616">配置</a>
<ul>
<li><a href="#org75fde3c">服务器</a></li>
<li><a href="#org9adccc7">客户端</a></li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example" id="org1054108">
国外版权意识比较重，如果下载盗版的影音文件很有可能会吃官司，所以大多数国外的 VPS 的使用条例都不允许下载 BT

但是一些人并不清楚这点，经常使用朋友分享给他的翻墙账号进行 BT 下载最终导致 VPS 被提供商封禁

尽管有时候说了不能使用代理下载 BT，对方也表示明白了清楚了，但总是有软件喜欢设置系统代理，也总有软件喜欢使用系统代理，好像也有不少人把路由器翻墙当成了不可或缺的，最终还是逃不了封禁的厄运

这个问题似乎从进入到 VPS 翻墙时代就困扰这大家，于是各种禁止 BT 的一键脚本也随之应运而生，也时常有人在讨论哪个脚本比较好用，其实最根本的几乎全是 IPTABLES 的字符串匹配
</pre>
<p>
在 V2Ray,修改配置文件的路由配置也可禁用 BT
</p>

<pre class="example" id="org924cf0b">
单从禁用 BT 来说的话，也许 IPTABLES 的方式会好一些，也可能不是

但是别忘了，V2Ray 的路由功能可不是只能禁止连接而已，本质应该是转发

也就是说，如果有一台无视版权的 VPS，那么大可将 BT 流量转到这台 VPS 上
</pre>
<div id="outline-container-org01ce616" class="outline-2">
<h2 id="org01ce616">配置</h2>
<div class="outline-text-2" id="text-org01ce616">
</div>
<div id="outline-container-org75fde3c" class="outline-3">
<h3 id="org75fde3c">服务器</h3>
<div class="outline-text-3" id="text-org75fde3c">
<p>
此配置阻断被转发到服务器的 BitTorrent 连接
</p>
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"log"</span>: {
        <span style="color: #ffa07a;">"loglevel"</span>: <span style="color: #ffa07a;">"warning"</span>
    },
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [
                    <span style="color: #ffa07a;">"http"</span>,
                    <span style="color: #ffa07a;">"tls"</span>
                ]
            },
            <span style="color: #ffa07a;">"port"</span>: 16823,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"clients"</span>: [
                    {
                        <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                        <span style="color: #ffa07a;">"alterId"</span>: 0
                    }
                ]
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {}
        },
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"blackhole"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {},
            <span style="color: #ffa07a;">"tag"</span>: <span style="color: #ffa07a;">"block"</span>
        }
    ],
    <span style="color: #ffa07a;">"routing"</span>: {
        <span style="color: #ffa07a;">"domainStrategy"</span>: <span style="color: #ffa07a;">"AsIs"</span>,
        <span style="color: #ffa07a;">"rules"</span>: [
            {
                <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
                <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"block"</span>,
                <span style="color: #ffa07a;">"protocol"</span>: [
                    <span style="color: #ffa07a;">"bittorrent"</span>
                ]
            }
        ]
    }
}
</pre>
</div>

<p>
注意：inbound 的 sniffing 必须开启
</p>
</div>
</div>
<div id="outline-container-org9adccc7" class="outline-3">
<h3 id="org9adccc7">客户端</h3>
<div class="outline-text-3" id="text-org9adccc7">
<p>
此配置让使用代理的 BitTorrent 连接直连：
</p>

<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"log"</span>: {
        <span style="color: #ffa07a;">"loglevel"</span>: <span style="color: #ffa07a;">"warning"</span>
    },
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>,
                <span style="color: #ffa07a;">"udp"</span>: <span style="color: #7fffd4;">true</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"serveraddr.com"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 16823,  
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,
                                <span style="color: #ffa07a;">"alterId"</span>: 0
                            }
                        ]
                    }
                ]
            }
        },
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {},
            <span style="color: #ffa07a;">"tag"</span>: <span style="color: #ffa07a;">"direct"</span> <span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#22914;&#26524;&#35201;&#20351;&#29992;&#36335;&#30001;&#65292;&#36825;&#20010; tag &#26159;&#19968;&#23450;&#35201;&#26377;&#30340;&#65292;&#22312;&#36825;&#37324; direct &#23601;&#26159; freedom &#30340;&#19968;&#20010;&#26631;&#21495;&#65292;&#22312;&#36335;&#30001;&#20013;&#35828; direct V2Ray &#23601;&#30693;&#36947;&#26159;&#36825;&#37324;&#30340; freedom &#20102;</span>
        }
    ],
    <span style="color: #ffa07a;">"routing"</span>: {
        <span style="color: #ffa07a;">"domainStrategy"</span>: <span style="color: #ffa07a;">"AsIs"</span>,
        <span style="color: #ffa07a;">"rules"</span>: [
            {
                <span style="color: #ffa07a;">"type"</span>: <span style="color: #ffa07a;">"field"</span>,
                <span style="color: #ffa07a;">"outboundTag"</span>: <span style="color: #ffa07a;">"direct"</span>,
                <span style="color: #ffa07a;">"protocol"</span>: [
                    <span style="color: #ffa07a;">"bittorrent"</span>
                ]
            }
        ]
    }
}
</pre>
</div>

<p>
同样 inbound 的 sniffing 必须开启
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="load_balancer.html">Next：负载均衡</a></td>
<td class="org-left"><a href="site_data.html">Previous：域名文件</a></td>
<td class="org-left"><a href="route.html">Home：路由</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
